---
title: "C. Лабораторная работа №2"
summary: Алгебраические вычисления
description: Алгебраические вычисления
draft: false
math: true
weight: 20
robotsNoIndex: true
---

### Задания для самостоятельного выполнения

1. Изучите математические функции, содержащиеся в заголовочном файле `math.h`.
2. Найдите отрезок, на котором функции из вашего варианта определены.
3. Напишите программу, решающую задачу по номеру своего варианта.


### Требования и ограничения

Значение \\(x\\) вводить с клавиатуры. Обработать ввод с клавиатуры таким образом, чтобы расчёт вёлся только для допустимых значений вводимых параметров. Программа должна содержать единственный оператор `if`.

### Указания по выполнению работы

Для использования математических функций в программу необходимо включить заголовочный файл `<math.h>`, содержащий прототипы математических функций и макроопределения констант. Кроме того, при компиляции программы нужно указать ключ `-lm` для подключения соответствующей библиотеки. Если вы используете CLion, то нужно добавить строку `link_libraries(m)` в файл `CMakeLists.txt`.


| Математическая функция | Функция в C |
|     :-----------:      | :---------: |
| \\( \sin x \\)         |  `sin(x)`   |
| \\( \cos x \\)         |  `cos(x)`   |
| \\( \tg x \\)          |  `tan(x)`   |
| \\( \arcsin x \\)      |  `asin(x)`  |
| \\( \arccos x \\)      |  `acos(x)`  |
| \\( \arctg x \\)       |  `atan(x)`  |
| \\( \ln x \\)          |  `log(x)`   |
| \\( \lg x \\)          |  `log10(x)` |
| \\( \|x\| \\)          |  `fabs(x)`  |
| \\( \sqrt x \\)        |  `sqrt(x)`  |
| \\( x^y \\)            | `pow(x, y)` |
| \\( e^x \\)            |  `exp(x)`   |
| \\( \operatorname{sgn} x \\) | отсутствует |

### Пример

Вычислить \\(y = x \sqrt{1 + x^2} + \arcsin x, z = e^y \sqrt{1 + e^{2y}} \\)

```c
#include <stdio.h>
#include <math.h>

int main()
{
    double x;
    printf("Enter x { -1.0 <= x <= 1.0 } -> ");
    scanf("%lf", &x);
    if (-1.0 <= x && x <= 1.0)
    {
        double y = x * sqrt (1.0 + x * x) + asin(x);
        double z = exp(y) * sqrt(1.0 + exp(2.0 * y));
        printf("y(x) = %lf\nz(y) = %lf\n", y, z);
    }
    else
        printf("x value is incorrect!\n");
    return 0;
}
```

#### Результаты работы программы
```text
Enter x { -1.0 <= x <= 1.0 } -> 0.23
y(x) = 0.468083
z(y) = 3.008924
```

### Варианты заданий

1. \\( y = \ln \frac{1+x}{1-x}, z = \frac{y^2}{1+y}. \\)
2. \\( y = \arccos (2\sin x), z = \sqrt{\cos y^2}. \\)
3. \\( y = \frac{2^x + 2^{-x}}{2}, z = \sqrt{2 + y - y^2}. \\)
4. \\( y = \ctg \pi x + \arccos(2^x), z = \operatorname{sgn} y. \\)
5. \\( y = \sqrt{\sin 2x} + \sqrt{\sin 3x}, z = \sqrt[4]{\ln \tg (y - \frac{\pi}{8})}. \\)
6. \\( y = 5\sqrt{\sin \sqrt{x}}, z = \lg \cos \ln y. \\)
7. \\( y = (x - 2)\sqrt{\frac{1+x}{1-x}}, z = \ln (y^2 - 1). \\)
8. \\( y = -\ln(x+2) - \ln(x-2), z = \sqrt{3y - y^3}. \\)
9. \\( y = \arccos \frac{2x}{1+x^2}, z = \ln \sin \frac{\pi}{y}. \\)
10. \\( y = \frac{\sqrt{x}}{\sin \pi x}, z = \operatorname{sgn} y. \\)
11. \\( y = \arcsin(4-x) + \ln \ln x, z = \arccos \frac{2y}{1+y}. \\)
12. \\( y = \arcsin \lg x, z = (y + |y|) \sqrt{y \sin^2 \pi y}. \\)
